{"id":1603,"date":"2021-10-12T12:35:38","date_gmt":"2021-10-12T12:35:38","guid":{"rendered":"https:\/\/axilthemes.com\/themes\/abstrak\/?p=1603"},"modified":"2021-10-12T12:35:38","modified_gmt":"2021-10-12T12:35:38","slug":"follow-your-own-design-process-whatever-gets-you-to-the-outcome","status":"publish","type":"post","link":"https:\/\/new.axilthemes.com\/themes\/abstrak\/follow-your-own-design-process-whatever-gets-you-to-the-outcome\/","title":{"rendered":"Follow your own design process, whatever gets you to the outcome."},"content":{"rendered":"\n<p>So what UX and UI trends have we seen so far in 2020, and what more are we headed for this year? Our experts pick seven trends to watch.<\/p>\n\n\n\n<h4>1. Subtle Animation<\/h4>\n\n\n\n<p>Subtle motion can be a simple way to lift an otherwise tired web page, and recently we’re seeing it more and more in designs for typically dry subject matter (think finance, healthcare, or resourcing services). Of course, it’s important to achieve balance and ensure movement doesn’t dominate or distract on the page.<\/p>\n\n\n\n<p>“In 2019 animation may have been a little overused,” says Stephen Cronin, Envato’s Content Specialist for websites and themes. “Hopefully 2020 will see it used more cleverly, with more subtle animation used to support user engagement and more obvious animation used to draw attention to just one or two calls to action.”<\/p>\n\n\n\n<p>SEEK’s career advice page shows subtle animation in action—using a simple, straightforward idea to add fun and dynamism to an otherwise predictable navigation page.<\/p>\n\n\n\n<p>With a customizable HTML template like Lums by Layerdrops, which includes landing pages, inner pages, a carousel slider, and CSS3 animation, you can start testing out what works.<\/p>\n\n\n\n<h4>2. Neumorphism<\/h4>\n\n\n\n<p>It’s arrived in a big way in the first few months of 2020, and it continues to get plenty of hype. But what is neumorphism?<\/p>\n\n\n\n<p>First, the word itself: it’s a play on ‘new’ and ‘skeuomorphism’, the latter a term used in UI design to describe design elements that look like their real-life counterparts—for example, your computer’s calculator interface or a floppy disk to represent ‘save’. It was Apple that first championed skeuomorphic designs under the reign of Steve Jobs, before heralding the decline of skeuomorphism as its post-2013 mobile software became progressively more simplified.<\/p>\n\n\n\n<p>“Neumorphism combines the best of flat design and skeuomorphism; we’re talking about clean interfaces, given a big hit of solidity through clever use of highlights and shadows,”&nbsp;<a href=\"https:\/\/axilthemes.com\/demo\/template\/abstrak\/single-blog-video.html#\">writes Jim McCauley on Creative Bloq.<\/a><\/p>\n\n\n\n<p>The trend’s heavy use of soft shadow makes for design that is both futuristic and realistic, and it’s bringing a new feel to familiar interfaces. However, the challenge to designers embracing this trend will be in its practicality—as Uyen Vicky Vo writes on UX Collective, neumorphism and accessibility don’t inherently go together.<\/p>\n\n\n\n<p>Experiment with 26 elements included in the Neumorphic UI Kit by cerpow or the super-flexible&nbsp;<a href=\"https:\/\/axilthemes.com\/demo\/template\/abstrak\/single-blog-video.html#\">Neumorphic UI for Smart House by merkulove<\/a>, both available on Envato Elements.<\/p>\n\n\n\n<h4>3. Large Images<\/h4>\n\n\n\n<p>Bigger is better and getting better in 2020. While illustration is also still at the fore of website design, where illustration isn’t used, it’s images that are showing up as the main attraction. And they’re being used cleverly—whether as full, subtle backgrounds or as striking centerpieces.<\/p>\n\n\n\n<p>“In 2020, having some sort of image (or background video) on your website is a must, and it’s a case of the larger the better,” says Stephen.<\/p>\n\n\n\n<p>For backgrounds, think minimal design like the tranquil&nbsp;<a href=\"https:\/\/axilthemes.com\/demo\/template\/abstrak\/single-blog-video.html#\">Lana template for ‘coming soon’ pages by Erilisdesign.<\/a>&nbsp;Or test out something more dynamic, like Rideo by codecarnival, a mountain-biking eCommerce template.<\/p>\n\n\n\n<h4>4. Breaking Design Rules<\/h4>\n\n\n\n<p>Good news for the anarchists among us: 2020 might be the time to throw the rules out the window.<\/p>\n\n\n\n<p>“Let’s break that grid and go with an asymmetrical layout. Let’s use a wild font that is not as readable. Let’s include hand drawn elements. Let’s put some elements over the top of other ones, obscuring them,” suggests Stephen (wherever it doesn’t significantly affect usability).<\/p>\n\n\n\n<p>This trend is mixed in with emerging design trends like the street art aesthetic and the resurgence of the anti-design Brutalist style (seen in things like Brutalist Bootstrap HTML Template by mp-web on ThemeForest).<\/p>\n\n\n\n<p>“I think this is an important trend,” says Tahlia Giannopoulas, Envato User Experience Designer, “because it challenges beautiful design and pushes people to make something engaging which isn’t conventional.”<\/p>\n\n\n\n<h4>5. Variable Fonts<\/h4>\n\n\n\n<p>Typographists will rejoice at this tip: never underestimate the right font in your UX design. A variable font is one file that gives you many options—achieving different appearances with options for spacing, weights, and widths, and leading to improved performance and smoother transitions between styles.<\/p>\n\n\n\n<p>“With browser support improving, 2020 could be the year that variable fonts break out and become commonplace in themes and templates,” predicts Stephen.<\/p>\n\n\n\n<p>Unsure where to start or want to go back to the basics first? Variable fonts are explained in more detail, with example fonts and step-by-step instructions on adding variable fonts to a web page, in this&nbsp;<a href=\"https:\/\/design.tutsplus.com\/articles\/how-to-use-variable-fonts-on-the-web--cms-30212\">how-to guide.<\/a><\/p>\n\n\n\n<h4>6. Branding and Art Direction in UX\/UI Design<\/h4>\n\n\n\n<p>Ultimately, UI and UX designers are experts in bringing various elements—imagery, text, color, interaction—together as a cohesive design to break down the distance between screen and customer. And increasingly, these skills don’t necessarily come from those with tech backgrounds.<\/p>\n\n\n\n<p>At Google, Jefferson Cheng and Emily Blank, who co-run the Material Design Imagery Program, recently spoke on&nbsp;<a href=\"https:\/\/design.google\/library\/why-google-needs-art-directors\/\">Google’s approach to pushing the boundaries of typical UX<\/a><\/p>\n\n\n\n<p>“We don’t really prescribe a one-size-fits-all style for all of Google,” said Jefferson. He mentioned that often artists and designers who haven’t worked in tech before have a unique and valuable approach.<\/p>\n\n\n\n<p>“For one of our design sprints we went to the Walt Disney Museum in San Francisco, and I thought it was so fascinating how through a variety of visual, stylistic elements, you can always tell a Disney movie from another animated film,” said Emily Blank in the same interview.<\/p>\n\n\n\n<p>The message here is pretty clear: when it comes to UX and UI, it’s most important to be cohesive, distinctive, and to keep evolving.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>So what UX and UI trends have we seen so far in 2020, and what more are we headed for this year? Our experts pick seven trends to watch. 1. Subtle Animation Subtle motion can be a simple way to lift an otherwise tired web page, and recently we’re seeing it more and more in [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":16,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"video","meta":[],"categories":[18],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/new.axilthemes.com\/themes\/abstrak\/wp-json\/wp\/v2\/posts\/1603"}],"collection":[{"href":"https:\/\/new.axilthemes.com\/themes\/abstrak\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/new.axilthemes.com\/themes\/abstrak\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/new.axilthemes.com\/themes\/abstrak\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/new.axilthemes.com\/themes\/abstrak\/wp-json\/wp\/v2\/comments?post=1603"}],"version-history":[{"count":0,"href":"https:\/\/new.axilthemes.com\/themes\/abstrak\/wp-json\/wp\/v2\/posts\/1603\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/new.axilthemes.com\/themes\/abstrak\/wp-json\/wp\/v2\/media\/16"}],"wp:attachment":[{"href":"https:\/\/new.axilthemes.com\/themes\/abstrak\/wp-json\/wp\/v2\/media?parent=1603"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/new.axilthemes.com\/themes\/abstrak\/wp-json\/wp\/v2\/categories?post=1603"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/new.axilthemes.com\/themes\/abstrak\/wp-json\/wp\/v2\/tags?post=1603"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}